node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 144
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 108
        }
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\220\000\000\000\364\001\000\000"
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0965234190226
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0965234190226
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "dyn_model/layer_0/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "dyn_model/layer_0/kernel/Initializer/random_uniform/max"
  input: "dyn_model/layer_0/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "dyn_model/layer_0/kernel/Initializer/random_uniform/RandomUniform"
  input: "dyn_model/layer_0/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel/Initializer/random_uniform"
  op: "Add"
  input: "dyn_model/layer_0/kernel/Initializer/random_uniform/mul"
  input: "dyn_model/layer_0/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 144
        }
        dim {
          size: 500
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel/Assign"
  op: "Assign"
  input: "dyn_model/layer_0/kernel"
  input: "dyn_model/layer_0/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "dyn_model/layer_0/kernel/read"
  op: "Identity"
  input: "dyn_model/layer_0/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 500
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 500
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "dyn_model/layer_0/bias/Assign"
  op: "Assign"
  input: "dyn_model/layer_0/bias"
  input: "dyn_model/layer_0/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "dyn_model/layer_0/bias/read"
  op: "Identity"
  input: "dyn_model/layer_0/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_0/bias"
      }
    }
  }
}
node {
  name: "dyn_model/layer_0/MatMul"
  op: "MatMul"
  input: "Placeholder"
  input: "dyn_model/layer_0/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "dyn_model/layer_0/BiasAdd"
  op: "BiasAdd"
  input: "dyn_model/layer_0/MatMul"
  input: "dyn_model/layer_0/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "dyn_model/layer_0/Relu"
  op: "Relu"
  input: "dyn_model/layer_0/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\364\001\000\000\364\001\000\000"
      }
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0774596706033
      }
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0774596706033
      }
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "dyn_model/layer_1/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "seed2"
    value {
      i: 22
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "dyn_model/layer_1/kernel/Initializer/random_uniform/max"
  input: "dyn_model/layer_1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "dyn_model/layer_1/kernel/Initializer/random_uniform/RandomUniform"
  input: "dyn_model/layer_1/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel/Initializer/random_uniform"
  op: "Add"
  input: "dyn_model/layer_1/kernel/Initializer/random_uniform/mul"
  input: "dyn_model/layer_1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 500
        }
        dim {
          size: 500
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel/Assign"
  op: "Assign"
  input: "dyn_model/layer_1/kernel"
  input: "dyn_model/layer_1/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "dyn_model/layer_1/kernel/read"
  op: "Identity"
  input: "dyn_model/layer_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_1/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 500
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "dyn_model/layer_1/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 500
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "dyn_model/layer_1/bias/Assign"
  op: "Assign"
  input: "dyn_model/layer_1/bias"
  input: "dyn_model/layer_1/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "dyn_model/layer_1/bias/read"
  op: "Identity"
  input: "dyn_model/layer_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_1/bias"
      }
    }
  }
}
node {
  name: "dyn_model/layer_1/MatMul"
  op: "MatMul"
  input: "dyn_model/layer_0/Relu"
  input: "dyn_model/layer_1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "dyn_model/layer_1/BiasAdd"
  op: "BiasAdd"
  input: "dyn_model/layer_1/MatMul"
  input: "dyn_model/layer_1/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "dyn_model/layer_1/Relu"
  op: "Relu"
  input: "dyn_model/layer_1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\364\001\000\000l\000\000\000"
      }
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.0993399247527
      }
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0993399247527
      }
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "dyn_model/layer_out/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 3
    }
  }
  attr {
    key: "seed2"
    value {
      i: 39
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "dyn_model/layer_out/kernel/Initializer/random_uniform/max"
  input: "dyn_model/layer_out/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "dyn_model/layer_out/kernel/Initializer/random_uniform/RandomUniform"
  input: "dyn_model/layer_out/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel/Initializer/random_uniform"
  op: "Add"
  input: "dyn_model/layer_out/kernel/Initializer/random_uniform/mul"
  input: "dyn_model/layer_out/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 500
        }
        dim {
          size: 108
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel/Assign"
  op: "Assign"
  input: "dyn_model/layer_out/kernel"
  input: "dyn_model/layer_out/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "dyn_model/layer_out/kernel/read"
  op: "Identity"
  input: "dyn_model/layer_out/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/kernel"
      }
    }
  }
}
node {
  name: "dyn_model/layer_out/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 108
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "dyn_model/layer_out/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 108
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "dyn_model/layer_out/bias/Assign"
  op: "Assign"
  input: "dyn_model/layer_out/bias"
  input: "dyn_model/layer_out/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "dyn_model/layer_out/bias/read"
  op: "Identity"
  input: "dyn_model/layer_out/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@dyn_model/layer_out/bias"
      }
    }
  }
}
node {
  name: "dyn_model/layer_out/MatMul"
  op: "MatMul"
  input: "dyn_model/layer_1/Relu"
  input: "dyn_model/layer_out/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "dyn_model/layer_out/BiasAdd"
  op: "BiasAdd"
  input: "dyn_model/layer_out/MatMul"
  input: "dyn_model/layer_out/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "mse_loss/SquaredDifference"
  op: "SquaredDifference"
  input: "Placeholder_1"
  input: "dyn_model/layer_out/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/assert_broadcastable/weights"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "mse_loss/assert_broadcastable/weights/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "mse_loss/assert_broadcastable/weights/rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "mse_loss/assert_broadcastable/values/shape"
  op: "Shape"
  input: "mse_loss/SquaredDifference"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "mse_loss/assert_broadcastable/values/rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "mse_loss/assert_broadcastable/static_scalar_check_success"
  op: "NoOp"
}
node {
  name: "mse_loss/ToFloat_3/x"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "mse_loss/Mul"
  op: "Mul"
  input: "mse_loss/SquaredDifference"
  input: "mse_loss/ToFloat_3/x"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/Const"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "mse_loss/Sum"
  op: "Sum"
  input: "mse_loss/Mul"
  input: "mse_loss/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "mse_loss/num_present/Equal/y"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mse_loss/num_present/Equal"
  op: "Equal"
  input: "mse_loss/ToFloat_3/x"
  input: "mse_loss/num_present/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/num_present/zeros_like"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mse_loss/num_present/ones_like/Shape"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "mse_loss/num_present/ones_like/Const"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "mse_loss/num_present/ones_like"
  op: "Fill"
  input: "mse_loss/num_present/ones_like/Shape"
  input: "mse_loss/num_present/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/num_present/Select"
  op: "Select"
  input: "mse_loss/num_present/Equal"
  input: "mse_loss/num_present/zeros_like"
  input: "mse_loss/num_present/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/num_present/broadcast_weights/assert_broadcastable/weights/shape"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "mse_loss/num_present/broadcast_weights/assert_broadcastable/weights/rank"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "mse_loss/num_present/broadcast_weights/assert_broadcastable/values/shape"
  op: "Shape"
  input: "mse_loss/SquaredDifference"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "mse_loss/num_present/broadcast_weights/assert_broadcastable/values/rank"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "mse_loss/num_present/broadcast_weights/assert_broadcastable/static_scalar_check_success"
  op: "NoOp"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
}
node {
  name: "mse_loss/num_present/broadcast_weights/ones_like/Shape"
  op: "Shape"
  input: "mse_loss/SquaredDifference"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  input: "^mse_loss/num_present/broadcast_weights/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "mse_loss/num_present/broadcast_weights/ones_like/Const"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  input: "^mse_loss/num_present/broadcast_weights/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "mse_loss/num_present/broadcast_weights/ones_like"
  op: "Fill"
  input: "mse_loss/num_present/broadcast_weights/ones_like/Shape"
  input: "mse_loss/num_present/broadcast_weights/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/num_present/broadcast_weights"
  op: "Mul"
  input: "mse_loss/num_present/Select"
  input: "mse_loss/num_present/broadcast_weights/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/num_present/Const"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "mse_loss/num_present"
  op: "Sum"
  input: "mse_loss/num_present/broadcast_weights"
  input: "mse_loss/num_present/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "mse_loss/Const_1"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "mse_loss/Sum_1"
  op: "Sum"
  input: "mse_loss/Sum"
  input: "mse_loss/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "mse_loss/Greater/y"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mse_loss/Greater"
  op: "Greater"
  input: "mse_loss/num_present"
  input: "mse_loss/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/Equal/y"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mse_loss/Equal"
  op: "Equal"
  input: "mse_loss/num_present"
  input: "mse_loss/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/ones_like/Shape"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "mse_loss/ones_like/Const"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "mse_loss/ones_like"
  op: "Fill"
  input: "mse_loss/ones_like/Shape"
  input: "mse_loss/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/Select"
  op: "Select"
  input: "mse_loss/Equal"
  input: "mse_loss/ones_like"
  input: "mse_loss/num_present"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/div"
  op: "RealDiv"
  input: "mse_loss/Sum_1"
  input: "mse_loss/Select"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "mse_loss/zeros_like"
  op: "Const"
  input: "^mse_loss/assert_broadcastable/static_scalar_check_success"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "mse_loss/value"
  op: "Select"
  input: "mse_loss/Greater"
  input: "mse_loss/div"
  input: "mse_loss/zeros_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gradients/Fill"
  op: "Fill"
  input: "gradients/Shape"
  input: "gradients/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/value_grad/zeros_like"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gradients/mse_loss/value_grad/Select"
  op: "Select"
  input: "mse_loss/Greater"
  input: "gradients/Fill"
  input: "gradients/mse_loss/value_grad/zeros_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/value_grad/Select_1"
  op: "Select"
  input: "mse_loss/Greater"
  input: "gradients/mse_loss/value_grad/zeros_like"
  input: "gradients/Fill"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/value_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/mse_loss/value_grad/Select"
  input: "^gradients/mse_loss/value_grad/Select_1"
}
node {
  name: "gradients/mse_loss/value_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/mse_loss/value_grad/Select"
  input: "^gradients/mse_loss/value_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/mse_loss/value_grad/Select"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/value_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/mse_loss/value_grad/Select_1"
  input: "^gradients/mse_loss/value_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/mse_loss/value_grad/Select_1"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/mse_loss/div_grad/Shape"
  input: "gradients/mse_loss/div_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/RealDiv"
  op: "RealDiv"
  input: "gradients/mse_loss/value_grad/tuple/control_dependency"
  input: "mse_loss/Select"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/Sum"
  op: "Sum"
  input: "gradients/mse_loss/div_grad/RealDiv"
  input: "gradients/mse_loss/div_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/Reshape"
  op: "Reshape"
  input: "gradients/mse_loss/div_grad/Sum"
  input: "gradients/mse_loss/div_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/Neg"
  op: "Neg"
  input: "mse_loss/Sum_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/RealDiv_1"
  op: "RealDiv"
  input: "gradients/mse_loss/div_grad/Neg"
  input: "mse_loss/Select"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/RealDiv_2"
  op: "RealDiv"
  input: "gradients/mse_loss/div_grad/RealDiv_1"
  input: "mse_loss/Select"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/mul"
  op: "Mul"
  input: "gradients/mse_loss/value_grad/tuple/control_dependency"
  input: "gradients/mse_loss/div_grad/RealDiv_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/Sum_1"
  op: "Sum"
  input: "gradients/mse_loss/div_grad/mul"
  input: "gradients/mse_loss/div_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/Reshape_1"
  op: "Reshape"
  input: "gradients/mse_loss/div_grad/Sum_1"
  input: "gradients/mse_loss/div_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/mse_loss/div_grad/Reshape"
  input: "^gradients/mse_loss/div_grad/Reshape_1"
}
node {
  name: "gradients/mse_loss/div_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/mse_loss/div_grad/Reshape"
  input: "^gradients/mse_loss/div_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/mse_loss/div_grad/Reshape"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/div_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/mse_loss/div_grad/Reshape_1"
  input: "^gradients/mse_loss/div_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/mse_loss/div_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/Sum_1_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/mse_loss/Sum_1_grad/Reshape"
  op: "Reshape"
  input: "gradients/mse_loss/div_grad/tuple/control_dependency"
  input: "gradients/mse_loss/Sum_1_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/Sum_1_grad/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/mse_loss/Sum_1_grad/Tile"
  op: "Tile"
  input: "gradients/mse_loss/Sum_1_grad/Reshape"
  input: "gradients/mse_loss/Sum_1_grad/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/Select_grad/zeros_like"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gradients/mse_loss/Select_grad/Select"
  op: "Select"
  input: "mse_loss/Equal"
  input: "gradients/mse_loss/div_grad/tuple/control_dependency_1"
  input: "gradients/mse_loss/Select_grad/zeros_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/Select_grad/Select_1"
  op: "Select"
  input: "mse_loss/Equal"
  input: "gradients/mse_loss/Select_grad/zeros_like"
  input: "gradients/mse_loss/div_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/Select_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/mse_loss/Select_grad/Select"
  input: "^gradients/mse_loss/Select_grad/Select_1"
}
node {
  name: "gradients/mse_loss/Select_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/mse_loss/Select_grad/Select"
  input: "^gradients/mse_loss/Select_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/mse_loss/Select_grad/Select"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/Select_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/mse_loss/Select_grad/Select_1"
  input: "^gradients/mse_loss/Select_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/mse_loss/Select_grad/Select_1"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/Sum_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/Sum_grad/Reshape"
  op: "Reshape"
  input: "gradients/mse_loss/Sum_1_grad/Tile"
  input: "gradients/mse_loss/Sum_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/Sum_grad/Shape"
  op: "Shape"
  input: "mse_loss/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/Sum_grad/Tile"
  op: "Tile"
  input: "gradients/mse_loss/Sum_grad/Reshape"
  input: "gradients/mse_loss/Sum_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/Shape"
  op: "Shape"
  input: "mse_loss/SquaredDifference"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/mse_loss/Mul_grad/Shape"
  input: "gradients/mse_loss/Mul_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/mul"
  op: "Mul"
  input: "gradients/mse_loss/Sum_grad/Tile"
  input: "mse_loss/ToFloat_3/x"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/Sum"
  op: "Sum"
  input: "gradients/mse_loss/Mul_grad/mul"
  input: "gradients/mse_loss/Mul_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/Reshape"
  op: "Reshape"
  input: "gradients/mse_loss/Mul_grad/Sum"
  input: "gradients/mse_loss/Mul_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/mul_1"
  op: "Mul"
  input: "mse_loss/SquaredDifference"
  input: "gradients/mse_loss/Sum_grad/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/Sum_1"
  op: "Sum"
  input: "gradients/mse_loss/Mul_grad/mul_1"
  input: "gradients/mse_loss/Mul_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/Reshape_1"
  op: "Reshape"
  input: "gradients/mse_loss/Mul_grad/Sum_1"
  input: "gradients/mse_loss/Mul_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^gradients/mse_loss/Mul_grad/Reshape"
  input: "^gradients/mse_loss/Mul_grad/Reshape_1"
}
node {
  name: "gradients/mse_loss/Mul_grad/tuple/control_dependency"
  op: "Identity"
  input: "gradients/mse_loss/Mul_grad/Reshape"
  input: "^gradients/mse_loss/Mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/mse_loss/Mul_grad/Reshape"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/Mul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "gradients/mse_loss/Mul_grad/Reshape_1"
  input: "^gradients/mse_loss/Mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gradients/mse_loss/Mul_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/num_present_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gradients/mse_loss/num_present_grad/Reshape"
  op: "Reshape"
  input: "gradients/mse_loss/Select_grad/tuple/control_dependency_1"
  input: "gradients/mse_loss/num_present_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/num_present_grad/Shape"
  op: "Shape"
  input: "mse_loss/num_present/broadcast_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/num_present_grad/Tile"
  op: "Tile"
  input: "gradients/mse_loss/num_present_grad/Reshape"
  input: "gradients/mse_loss/num_present_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/num_present/broadcast_weights_grad/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "gradients/mse_loss/num_present/broadcast_weights_grad/Shape_1"
  op: "Shape"
  input: "mse_loss/num_present/broadcast_weights/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/mse_loss/num_present/broadcast_weights_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
